[Metion_Shotgun X2WeaponTemplate]
FriendlyName="Metion Auto Shotgun"
FriendlyNamePlural="Metion Auto Shotguns"
BriefSummary="This extremely powerful Shotgun is capable of firing multiple shots in quick succession"
TacticalText="<Bullet/> Firing the primary weapon ends the soldier's turn, in the absence of special training.\n<Bullet/>"
AbilityDescName="Metion Auto Shotgun"

[Metion_AutoShot X2AbilityTemplate]
LocFriendlyName="Metion Burst Fire"
LocLongDescription="Fire three shots in a row at an enemy. Each shot suffers a bigger Aim penalty than the last."
LocHelpText="Fire three shots in a row at an enemy. Each shot suffers a bigger Aim penalty than the last."
LocFlyOverText="Metion Burst Fire"
LocPromotionPopupText="<Bullet/> Metion Burst Fire is a devastating ability for dealing ranged damage.<br/>"

[Metion_Shotgun X2TechTemplate]
DisplayName="Metion Pattern Magnetic Automatic Shotgun"
Summary="This extremely powerful Shotgun is capable of firing multiple shots in quick succession. L. Shen." 
